def count_letters(main_str):
    letter_count = {}  # создаём пустой словарь
    for i in main_str.lower(): #делаем все буквы строчными
        if i.isalpha(): #проверям, буква ли
            if i in letter_count:
                letter_count[i] += 1
            else:
                letter_count[i] = 1
    return letter_count


def calculate_frequency(letter_count):
    total_letters = sum(letter_count.values())  # находим сумму всех values
    frequency = {}  # создаём пустой словарь
    for k, c in letter_count.items():
        frequency[k] = c / total_letters  # находим частоту каждой буквы (количество 1 буквы делим на общее)
    return frequency

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

count_dict = count_letters(main_str)
frequency_dict = calculate_frequency(count_dict)

for a, b in frequency_dict.items():
    print(f"{a}: {b:.2f}")

